IDENTIFICATION DIVISION.
PROGRAM-ID. CBAV.
AUTHOR. SAEEDMALIK.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 CurrentName.
  02 NameMain PIC X(10).

PROCEDURE DIVISION.
Begin.
	DISPLAY "ENTER A VARIABLE NAME".
	ACCEPT NameMain.
	DISPLAY "Written:  " NameMain.
	STOP RUN.
