IDENTIFICATION DIVISION.
PROGRAM-ID. BANK.
AUTHOR. SAEEDMALIK.


DATA DIVISION.
WORKING-STORAGE SECTION.
01 CURRENTTASK	PIC 9(1) VALUE ZEROS.



PROCEDURE DIVISION.
Begin.
	DISPLAY "WELCOME TO TD WELLS AMERICHASE BANK".
	DISPLAY "1 - CHECK CURRENT ACCOUNTS".
	DISPLAY "2 - DEPOSIT MONEY INTO ACCOUNT".
	DISPLAY "3 - WITHDRAW MONEY FROM ACCOUNT".
	DISPLAY "9 - TO CLOSE APPLICATION".	

	
	PERFORM UNTIL CURRENTTASK = 9
		ACCEPT CURRENTTASK
		EVALUATE CURRENTTASK
			WHEN 1 DISPLAY "DISPLAYING CURRENT ACCOUNTS"
			WHEN 2 DISPLAY "DISPLAYING DEPOSIT"
			WHEN 3 DISPLAY "DISPLAYING WITHDRAW"
		END-EVALUATE
	END-PERFORM








	STOP RUN.


