IDENTIFICATION DIVISION.
PROGRAM-ID. BANK.
AUTHOR. SAEEDMALIK.


ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT MAINFILE ASSIGN "bankAccount.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	

DATA DIVISION.
FILE SECTION.
FD MAINFILE.
01 ACCOUNTINFOMF.
	88 EOFMF		VALUE HIGH-VALUES.
	02 ACCOUNTNUMBERMF	PIC 9(3).
	02 ACCOUNTNAMEMF	PIC X(12).
	02 ACCOUNTVALUEMF	PIC 9(6).
01 ACCOUNTINFOW.
	02 ACCOUNTNUMBERW	PIC 9(3).
	02 ACCOUNTNAMEW		PIC X(12).
	02 ACCOUNTVALUEW	PIC 9(6).

WORKING-STORAGE SECTION.
01 CURRENTTASK	PIC 9(1) VALUE ZEROS.

01 ACCOUNTINFO.
	02 ACCOUNTNUMBER	PIC 9(3).
	02 ACCOUNTNAME		PIC X(12).
	02 ACCOUNTVALUE		PIC 9(6).
01 DEPOSITVALUE		PIC 9(6).
01 DEPOSITVALUERESULT	PIC 9(6).
01 WITHDRAWVALUE	PIC 9(6).
01 WITHDRAWRESULT	PIC 9(6).

PROCEDURE DIVISION.
Begin.
	DISPLAY "WELCOME TO TD WELLS AMERICHASE BANK".
	DISPLAY "1 - CHECK CURRENT ACCOUNT".
	DISPLAY "2 - DEPOSIT MONEY INTO ACCOUNT".
	DISPLAY "3 - WITHDRAW MONEY FROM ACCOUNT".
	DISPLAY "9 - TO CLOSE APPLICATION".	

	
	PERFORM UNTIL CURRENTTASK = 9
		ACCEPT CURRENTTASK
		EVALUATE CURRENTTASK
			WHEN 1 PERFORM DISPLAYACCOUNTS
			WHEN 2 PERFORM DISPLAYDEPOSITS
			WHEN 3 PERFORM DISPLAYWITHDRAWS
		END-EVALUATE
	END-PERFORM








	STOP RUN.

DISPLAYACCOUNTS.
	DISPLAY "DISPLAYING CURRENT ACCOUNT".
	OPEN INPUT MAINFILE.
	READ MAINFILE
		AT END SET EOFMF TO TRUE
	END-READ.
	PERFORM UNTIL EOFMF
		DISPLAY ACCOUNTINFOMF
		READ MAINFILE
			AT END SET EOFMF TO TRUE
		END-READ
	END-PERFORM.
	CLOSE MAINFILE.	






DISPLAYDEPOSITS.

	DISPLAY "SPECIFY THE AMOUNT TO DEPOSIT INTO ACCOUNT".
	
	PERFORM SETMAINACCOUNTINFO	
	OPEN OUTPUT MAINFILE.
		
		ACCEPT DEPOSITVALUE
		ADD DEPOSITVALUE, ACCOUNTVALUE GIVING DEPOSITVALUERESULT
		DISPLAY "OLD VALUE IS " ACCOUNTVALUE. 
		DISPLAY "NEW VALUE IS " DEPOSITVALUERESULT.		
		ADD DEPOSITVALUE TO ACCOUNTVALUE 
		MOVE ACCOUNTINFO TO ACCOUNTINFOW
		WRITE ACCOUNTINFOW
	CLOSE MAINFILE.



DISPLAYWITHDRAWS.
	DISPLAY "SPECIFY THE AMOUNT TO WITHDRAW FROM ACCOUNT".

	PERFORM SETMAINACCOUNTINFO
	OPEN OUTPUT MAINFILE.
		ACCEPT WITHDRAWVALUE
		SUBTRACT WITHDRAWVALUE FROM ACCOUNTVALUE GIVING WITHDRAWRESULT
		DISPLAY "OLD VALUE IS " ACCOUNTVALUE.
		DISPLAY "NEW VALUE IS " WITHDRAWRESULT.
		SUBTRACT WITHDRAWVALUE FROM ACCOUNTVALUE
		MOVE ACCOUNTINFO TO ACCOUNTINFOW
		WRITE ACCOUNTINFOW
	CLOSE MAINFILE.


SETMAINACCOUNTINFO.
	OPEN INPUT MAINFILE.
	READ MAINFILE
		AT END SET EOFMF TO TRUE
	END-READ.
	PERFORM UNTIL EOFMF
		MOVE ACCOUNTINFOMF TO ACCOUNTINFO
		READ MAINFILE
			AT END SET EOFMF TO TRUE
		END-READ
	END-PERFORM.
	CLOSE MAINFILE.
















