IDENTIFICATION DIVISION.
PROGRAM-ID. CBCAL2.
AUTHOR. SAEEDMALIK.

DATA DIVISION.
WORKING-STORAGE SECTION. 
01	NUM1	PIC 9 	VALUE ZEROS.
01	NUM2	PIC 9	VALUE ZEROS. 
01	RESULT  PIC 99	VALUE ZEROS.
01	MODIF	PIC X	VALUE SPACE.

PROCEDURE DIVISION.
Begin. 
	DISPLAY "INPUT 2 NUMBERS, ONE AFTER ANOTHER FOLLOWED BY A MODIFIER * + - /".
	ACCEPT NUM1.
	ACCEPT NUM2.
	ACCEPT MODIF.
	IF MODIF = "+" THEN
		PERFORM AddFunction
	END-IF
	IF MODIF = "-" THEN 	
		PERFORM SubtractFunction
	END-IF
	IF MODIF = "*" THEN 
		PERFORM MultiplyFunction
	END-IF
	IF MODIF = "/" THEN 
		PERFORM DivideFunction
	END-IF
	STOP RUN.

AddFunction.
	DISPLAY "ADDING".
	ADD NUM1,NUM2 GIVING RESULT.
	DISPLAY RESULT.

SubtractFunction.
	DISPLAY "SUBTRACTING" SPACE NUM1 SPACE "FROM" SPACE NUM2.
	SUBTRACT NUM2 FROM NUM1 GIVING RESULT.
	DISPLAY RESULT.

MultiplyFunction.
	DISPLAY "MULTIPLYING" SPACE NUM1 SPACE "BY" SPACE NUM2.
	MULTIPLY NUM1 BY NUM2 GIVING RESULT.
	DISPLAY RESULT.

DivideFunction.
	DISPLAY "DIVIDING" SPACE NUM1 SPACE "BY" SPACE NUM2.
	DIVIDE NUM1 BY NUM2 GIVING RESULT.
	DISPLAY RESULT.
