IDENTIFICATION DIVISION.
PROGRAM-ID. CBCOUNTER.
AUTHOR. SAEEDMALIK.


DATA DIVISION.
WORKING-STORAGE SECTION.
01 MainCounter.
	02	TENS	PIC 99	VALUE ZEROS.
	02	UNITC	PIC 99	VALUE ZEROS.
01 PRNTVALS.
	02	PRNTENS	PIC 9.
	02	PRNUNIT	PIC 9. 

PROCEDURE DIVISION.
Begin.
	DISPLAY "A SIMPLE COUNTER".
	PERFORM COUNTMILEAGE
		VARYING TENS FROM 0 BY 1 UNTIL TENS > 2
		AFTER UNITC FROM 0 BY 1 UNTIL UNITC > 9
	STOP RUN.
	
COUNTMILEAGE.
	MOVE TENS TO PRNTENS
	MOVE UNITC TO PRNUNIT
	DISPLAY PRNTENS "-" SPACE PRNUNIT
