IDENTIFICATION DIVISION.
PROGRAM-ID. CBDIRECT.
AUTHOR. SAEEDMALIK.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT DIRECTBANK ASSIGN TO "directBank.dat"
	ORGANIZATION IS RELATIVE
	ACCESS MODE IS RANDOM
	RELATIVE KEY IS ACCOUNTKEY
	FILE STATUS IS FILESTATUS.

	SELECT SEQBANK ASSIGN TO "bankAccount.dat"
		ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD DIRECTBANK.
01	BANKRECORD.
	02 ACCOUNTNUMBER	PIC 9(3).
	02 ACCOUNTNAME		PIC X(12).
	02 ACCOUNTVALUE		PIC 9(6).

FD SEQBANK.
01	SEQBANKRECORD.
	88 EOF			VALUES	HIGH-VALUES.
	02 ACCOUNTNUMBERSQ	PIC 9(3).
	02 ACCOUNTNAMESQ	PIC X(12).
	02 ACCOUNTVALUESQ	PIC 9(6).

WORKING-STORAGE SECTION.
01	FILESTATUS	PIC X(2).

01	ACCOUNTKEY	PIC 9(3).

PROCEDURE DIVISION.
Begin. 
	DISPLAY "TRANSFER SEQUENTIAL DATA TO RELATIVE/DIRECT DATA".
	OPEN OUTPUT DIRECTBANK.
	OPEN INPUT SEQBANK.

	READ SEQBANK
		AT END SET EOF TO TRUE
	END-READ
	
	PERFORM UNTIL EOF
		MOVE ACCOUNTNUMBERSQ TO ACCOUNTKEY
		MOVE SEQBANKRECORD TO BANKRECORD
		WRITE BANKRECORD
			INVALID KEY DISPLAY "RECORD STATUS = " FILESTATUS
		END-WRITE
		READ SEQBANK
			AT END SET EOF TO TRUE
		END-READ
	END-PERFORM.

	CLOSE DIRECTBANK, SEQBANK.

	STOP RUN.




