IDENTIFICATION DIVISION.
PROGRAM-ID. CBFILE.
AUTHOR. SAEEDMALIK.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT ITEMSFILE ASSIGN TO "items.dat"
		ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD ITEMSFILE.
01 ITEMRECORD.
	02 ItemName	PIC X(5).
	02 ItemID	PIC X(2).
	02 ItemL	PIC X(2).

PROCEDURE DIVISION.
Begin. 
	OPEN OUTPUT ITEMSFILE
	
	PERFORM GetItemRecord
	PERFORM UNTIL ITEMRECORD = "Done"
		WRITE ITEMRECORD
		PERFORM GetItemRecord
	END-PERFORM.
	CLOSE ITEMSFILE
	STOP RUN.

GetItemRecord.
	DISPLAY "WRITE ITEMNAME(5)ID(2)LOC(2)"
	ACCEPT ITEMRECORD
