IDENTIFICATION DIVISION.
PROGRAM-ID. CBINPUTPRO.
AUTHOR. SAEEDMALIK.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT UNSRTSTATEIN ASSIGN "unsrtStateIn.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT SRTSTATEIN ASSIGN "srtStatein.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT WORKFILE ASSIGN "WORKFILE.TMP".

DATA DIVISION.
FILE SECTION.
FD UNSRTSTATEIN.
01 UNSRTSTATEINF.
	88	EOF	VALUE	HIGH-VALUES.
	02	STATENAME	PIC X(2).
	02	STATECODE	PIC 9(2).

FD SRTSTATEIN.
01 SRTSTATEINNF.
	02	STATENAMENF	PIC X(2).
	02	STATECODENF	PIC 9(2).

SD WORKFILE.
01 STATEWF.
	02	STATENAMEWF	PIC X(2).
	02	STATECODEWF	PIC 9(2).


PROCEDURE DIVISION.
Begin.
	SORT WORKFILE ON ASCENDING STATECODEWF
		INPUT PROCEDURE IS FILTERSTATECODE
		GIVING SRTSTATEIN
	STOP RUN.

FILTERSTATECODE.
	OPEN INPUT UNSRTSTATEIN.
	READ UNSRTSTATEIN
		AT END SET EOF TO TRUE
	END-READ
	PERFORM UNTIL EOF
		IF STATECODE = "01"
			MOVE UNSRTSTATEINF TO STATEWF
			RELEASE STATEWF
		END-IF
		READ UNSRTSTATEIN
			AT END SET EOF TO TRUE
		END-READ
	END-PERFORM
	CLOSE UNSRTSTATEIN.
