IDENTIFICATION DIVISION.
PROGRAM-ID. CBSRT.
AUTHOR. SAEEDMALIK.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT UNSRTSTATEFILE ASSIGN "unsrtStates.dat"
		ORGANIZATION IS LINE SEQUENTIAL.
	SELECT SRTSTATEFILE ASSIGN "srtStates.dat"
		ORGANIZATION IS LINE SEQUENTIAL.

	SELECT WORKFILE ASSIGN "WORK.TMP".

DATA DIVISION.
FILE SECTION.
FD UNSRTSTATEFILE.
01	USSTATEUNSRT	PIC X(2).

FD SRTSTATEFILE.
01	USSTATESRT	PIC X(2).

SD WORKFILE.
01	USSTATEWF	PIC X(2).


PROCEDURE DIVISION.
Begin. 
	SORT WORKFILE ON ASCENDING USSTATEWF
		USING UNSRTSTATEFILE
		GIVING SRTSTATEFILE
	STOP RUN.
