IDENTIFICATION DIVISION.
PROGRAM-ID. CBTIMES.
AUTHOR. SAEEDMALIK.

DATA DIVISION.
WORKING-STORAGE SECTION.
01	NUM1	PIC 9	VALUE 	5.


PROCEDURE DIVISION.
Begin. 
	DISPLAY " A SIMPLE PERFORM INLINE LOOP"
	PERFORM NUM1 TIMES
		DISPLAY " HAHA "
	END-PERFORM.
	STOP RUN.


