IDENTIFICATION DIVISION.
PROGRAM-ID. displayOne.
AUTHOR. SAEEDMALIK.

DATA DIVISION.
LINKAGE SECTION.

01	VARIABLE1 	PIC X(3).

PROCEDURE DIVISION USING VARIABLE1.
Begin.
	DISPLAY "DISPLAYING VARIABLEONE FROM SUB PROGRAM".
	DISPLAY VARIABLE1.
	EXIT PROGRAM.
