IDENTIFICATION DIVISION.
PROGRAM-ID. CBCALLMAIN.
AUTHOR. SAEEDMALIK.

DATA DIVISION.
WORKING-STORAGE SECTION.
01	VARIABLE1	PIC X(3) VALUE "ONE".
01	VARIABLE2	PIC X(3) VALUE "TWO".


PROCEDURE DIVISION.
Begin.
	DISPLAY "CALLING SUBPROGRAM AND PASSING VARIABLE1 AS ONE".
	PERFORM CALLVARIABLE1.
	STOP RUN.

CALLVARIABLE1.
	CALL "displayOne" USING BY CONTENT VARIABLE1.
	
